In [1]:
import pandas as pd

In [ ]:
series = pd.Series([1,3,5,6,8])
series

In [3]:
data = {'apples' : [3,2,0,1],'oranges' : [0,3,7,2], 'peaches' : [2,4,6,8]}
fruits = pd.DataFrame(data)
fruits

   apples  oranges  peaches
0       3        0        2
1       2        3        4
2       0        7        6
3       1        2        8

In [6]:
buyer = pd.DataFrame(data,index=['Tom','Isabell','Daisy','Blathers'])
buyer
buyer.loc['Tom']

apples     3
oranges    0
peaches    2
Name: Tom, dtype: int64

In [7]:
buyer = buyer * 1_000_000
buyer

           apples  oranges  peaches
Tom       3000000        0  2000000
Isabell   2000000  3000000  4000000
Daisy           0  7000000  6000000
Blathers  1000000  2000000  8000000

In [8]:
buyer > 6_000_000

          apples  oranges  peaches
Tom        False    False    False
Isabell    False    False    False
Daisy      False     True    False
Blathers   False    False     True